'''
pow(num, power): возведение числа num в степень power

sqrt(num): квадратный корень числа num

ceil(num): округление числа до ближайшего наибольшего целого

floor(num): округление числа до ближайшего наименьшего целого

factorial(num): факториал числа

degrees(rad): перевод из радиан в градусы

radians(grad): перевод из градусов в радианы

cos(rad): косинус угла в радианах

sin(rad): синус угла в радианах

tan(rad): тангенс угла в радианах

acos(rad): арккосинус угла в радианах

asin(rad): арксинус угла в радианах

atan(rad): арктангенс угла в радианах

log(n, base): логарифм числа n по основанию base

log10(n): десятичный логарифм числа n
'''
