'''САМЫЕ ВАЖНЫЕ МЕТОДЫ СТРОК:

isalpha(): возвращает True, если строка состоит только из алфавитных символов

islower(): возвращает True, если строка состоит только из символов в нижнем регистре

isupper(): возвращает True, если все символы строки в верхнем регистре

isdigit(): возвращает True, если все символы строки - цифры

isnumeric(): возвращает True, если строка представляет собой число

startswith(str): возвращает True, если строка начинается с подстроки str

endswith(str): возвращает True, если строка заканчивается на подстроку str

lower(): переводит строку в нижний регистр

upper(): переводит строку в вехний регистр

title(): начальные символы всех слов в строке переводятся в верхний регистр

capitalize(): переводит в верхний регистр первую букву только самого первого слова строки

lstrip(): удаляет начальные пробелы из строки

rstrip(): удаляет конечные пробелы из строки

strip(): удаляет начальные и конечные пробелы из строки

ljust(width): если длина строки меньше параметра width, то справа от строки добавляются пробелы, чтобы дополнить значение width, а сама строка выравнивается по левому краю

rjust(width): если длина строки меньше параметра width, то слева от строки добавляются пробелы, чтобы дополнить значение width, а сама строка выравнивается по правому краю

center(width): если длина строки меньше параметра width, то слева и справа от строки равномерно добавляются пробелы, чтобы дополнить значение width, а сама строка выравнивается по центру

find(str[, start [, end]): возвращает индекс подстроки в строке. Если подстрока не найдена, возвращается число -1

replace(old, new[, num]): заменяет в строке одну подстроку на другую

split([delimeter[, num]]): разбивает строку на подстроки в зависимости от разделителя

join(strs): объединяет строки в одну строку, вставляя между ними определенный разделитель
'''